regression2/t_update_idx-innodb-multi/mariadb-10.2.22/sysbench.128.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 181 seconds

Threads started!

[   3s] threads: 128, tps: 8379.73, reads: 0.00, writes: 168410.31, response time: 25.86ms (95%), errors: 12.67, reconnects:  0.00
[   6s] threads: 128, tps: 8620.66, reads: 0.00, writes: 172346.44, response time: 24.35ms (95%), errors: 10.33, reconnects:  0.00
[   9s] threads: 128, tps: 9371.36, reads: 0.00, writes: 187673.51, response time: 22.21ms (95%), errors: 12.67, reconnects:  0.00
[  12s] threads: 128, tps: 9688.34, reads: 0.00, writes: 194172.86, response time: 21.44ms (95%), errors: 15.00, reconnects:  0.00
[  15s] threads: 128, tps: 9493.66, reads: 0.00, writes: 189655.48, response time: 22.27ms (95%), errors: 13.33, reconnects:  0.00
[  18s] threads: 128, tps: 9848.67, reads: 0.00, writes: 197128.66, response time: 21.11ms (95%), errors: 14.00, reconnects:  0.00
[  21s] threads: 128, tps: 9777.34, reads: 0.00, writes: 195752.12, response time: 21.45ms (95%), errors: 20.67, reconnects:  0.00
[  24s] threads: 128, tps: 9786.00, reads: 0.00, writes: 195869.34, response time: 21.23ms (95%), errors: 15.33, reconnects:  0.00
[  27s] threads: 128, tps: 9873.33, reads: 0.00, writes: 197796.28, response time: 21.28ms (95%), errors: 15.33, reconnects:  0.00
[  30s] threads: 128, tps: 9727.53, reads: 0.00, writes: 194829.83, response time: 21.18ms (95%), errors: 12.66, reconnects:  0.00
[  33s] threads: 128, tps: 9633.76, reads: 0.00, writes: 192676.29, response time: 22.35ms (95%), errors: 19.01, reconnects:  0.00
[  36s] threads: 128, tps: 9819.00, reads: 0.00, writes: 196442.91, response time: 21.23ms (95%), errors: 15.00, reconnects:  0.00
[  39s] threads: 128, tps: 9695.68, reads: 0.00, writes: 194263.18, response time: 21.51ms (95%), errors: 7.67, reconnects:  0.00
[  42s] threads: 128, tps: 9721.99, reads: 0.00, writes: 194543.90, response time: 21.87ms (95%), errors: 13.67, reconnects:  0.00
[  45s] threads: 128, tps: 9908.67, reads: 0.00, writes: 198360.42, response time: 21.11ms (95%), errors: 16.67, reconnects:  0.00
[  48s] threads: 128, tps: 9584.33, reads: 0.00, writes: 191724.32, response time: 22.12ms (95%), errors: 16.00, reconnects:  0.00
[  51s] threads: 128, tps: 9478.00, reads: 0.00, writes: 189670.74, response time: 22.87ms (95%), errors: 12.67, reconnects:  0.00
[  54s] threads: 128, tps: 9465.96, reads: 0.00, writes: 189207.63, response time: 22.47ms (95%), errors: 11.33, reconnects:  0.00
[  57s] threads: 128, tps: 9771.36, reads: 0.00, writes: 195931.29, response time: 21.40ms (95%), errors: 15.33, reconnects:  0.00
[  60s] threads: 128, tps: 9827.33, reads: 0.00, writes: 196673.53, response time: 21.46ms (95%), errors: 13.33, reconnects:  0.00
[  63s] threads: 128, tps: 9811.34, reads: 0.00, writes: 196534.13, response time: 21.83ms (95%), errors: 11.67, reconnects:  0.00
[  66s] threads: 128, tps: 9927.00, reads: 0.00, writes: 198495.08, response time: 21.07ms (95%), errors: 15.67, reconnects:  0.00
[  69s] threads: 128, tps: 9844.99, reads: 0.00, writes: 196998.51, response time: 21.05ms (95%), errors: 16.00, reconnects:  0.00
[  72s] threads: 128, tps: 9889.34, reads: 0.00, writes: 198180.05, response time: 21.14ms (95%), errors: 18.00, reconnects:  0.00
[  75s] threads: 128, tps: 9945.01, reads: 0.00, writes: 199223.22, response time: 20.89ms (95%), errors: 15.00, reconnects:  0.00
[  78s] threads: 128, tps: 10074.32, reads: 0.00, writes: 201399.13, response time: 20.58ms (95%), errors: 20.00, reconnects:  0.00
[  81s] threads: 128, tps: 9788.67, reads: 0.00, writes: 195871.07, response time: 21.11ms (95%), errors: 16.00, reconnects:  0.00
[  84s] threads: 128, tps: 9933.33, reads: 0.00, writes: 199100.35, response time: 20.90ms (95%), errors: 13.67, reconnects:  0.00
[  87s] threads: 128, tps: 10076.33, reads: 0.00, writes: 201830.17, response time: 20.95ms (95%), errors: 18.33, reconnects:  0.00
[  90s] threads: 128, tps: 10010.34, reads: 0.00, writes: 200096.12, response time: 20.72ms (95%), errors: 15.33, reconnects:  0.00
[  93s] threads: 128, tps: 9770.34, reads: 0.00, writes: 195620.75, response time: 21.68ms (95%), errors: 15.33, reconnects:  0.00
[  96s] threads: 128, tps: 9803.33, reads: 0.00, writes: 196369.88, response time: 21.20ms (95%), errors: 16.00, reconnects:  0.00
[  99s] threads: 128, tps: 10010.01, reads: 0.00, writes: 200500.80, response time: 20.92ms (95%), errors: 17.67, reconnects:  0.00
[ 102s] threads: 128, tps: 10059.63, reads: 0.00, writes: 201337.93, response time: 20.65ms (95%), errors: 17.00, reconnects:  0.00
[ 105s] threads: 128, tps: 9824.02, reads: 0.00, writes: 196497.43, response time: 21.08ms (95%), errors: 13.67, reconnects:  0.00
[ 108s] threads: 128, tps: 9787.01, reads: 0.00, writes: 196054.78, response time: 21.86ms (95%), errors: 17.00, reconnects:  0.00
[ 111s] threads: 128, tps: 9842.34, reads: 0.00, writes: 196913.76, response time: 21.30ms (95%), errors: 15.00, reconnects:  0.00
[ 114s] threads: 128, tps: 9719.99, reads: 0.00, writes: 194635.18, response time: 22.41ms (95%), errors: 19.00, reconnects:  0.00
[ 117s] threads: 128, tps: 9915.33, reads: 0.00, writes: 198428.37, response time: 21.49ms (95%), errors: 18.33, reconnects:  0.00
[ 120s] threads: 128, tps: 9983.01, reads: 0.00, writes: 199998.48, response time: 21.15ms (95%), errors: 18.67, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           23599794
        other:                           2359763
        total:                           25959557
    transactions:                        1178959 (9742.54 per sec.)
    read/write requests:                 23599794 (195021.07 per sec.)
    other operations:                    2359763 (19500.32 per sec.)
    ignored errors:                      1845   (15.25 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.0115s
    total number of events:              1178959
    total time taken by event execution: 15485.0800s
    response time:
         min:                                  2.29ms
         avg:                                 13.13ms
         max:                                 74.11ms
         approx.  95 percentile:              21.59ms

Threads fairness:
    events (avg/stddev):           9210.6172/36.13
    execution time (avg/stddev):   120.9772/0.01